In [2]:
%load_ext sql

%sql sqlite:///sns.db

In [3]:
%%sql
select * from sqlite_master

 * sqlite:///sns.db
Done.

[('table', 'billing_plan', 'billing_plan', 2, 'CREATE TABLE billing_plan (\n    billing_plan_id int primary key,\n    payment int\n)'),
 ('index', 'sqlite_autoindex_billing_plan_1', 'billing_plan', 3, None),
 ('table', 'user', 'user', 4, 'CREATE TABLE user (\n    user_id int primary key,\n    name varchar(30) not null,\n    birth_date text(10) not null,\n    account_number int,\n    bank varchar(30),\n    billing_plan_id int,\n    foreign key (billing_plan_id) references billing_plan(billing_plan_id)\n)'),
 ('index', 'sqlite_autoindex_user_1', 'user', 5, None),
 ('table', 'follow', 'follow', 6, 'CREATE TABLE follow(\n    follower_id int,\n    following_id int,\n    primary key (follower_id, following_id),\n    foreign key (follower_id) references user(user_id) on delete cascade,\n    foreign key (following_id) references user(user_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_follow_1', 'follow', 7, None),
 ('table', 'post', 'post', 8, 'CREATE TABLE post (\n    post_id int primary key,\n    text text,\n    user_id int,\n    foreign key (user_id) references user(user_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_post_1', 'post', 9, None),
 ('table', 'comment', 'comment', 10, 'CREATE TABLE comment (\n    comment_id int primary key,\n    comment text,\n    user_id int,\n    post_id int,\n    foreign key (user_id) references user(user_id) on delete cascade,\n    foreign key (post_id) references post(post_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_comment_1', 'comment', 11, None),
 ('table', 'like_comment', 'like_comment', 12, 'CREATE TABLE like_comment (\n    user_id int,\n    comment_id int,\n    primary key (user_id, comment_id)\n    foreign key (user_id) references user(user_id) on delete cascade,\n    foreign key (comment_id) references comment(comment_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_like_comment_1', 'like_comment', 13, None),
 ('table', 'like', 'like', 14, 'CREATE TABLE like (\n    user_id int,\n    post_id int,\n    primary key (user_id, post_id)\n    foreign key (user_id) references user(user_id) on delete cascade,\n    foreign key (post_id) references post(post_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_like_1', 'like', 15, None),
 ('table', 'view', 'view', 16, 'CREATE TABLE view (\n    user_id int,\n    post_id int,\n    primary key (user_id, post_id)\n    foreign key (user_id) references user(user_id) on delete cascade,\n    foreign key (post_id) references post(post_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_view_1', 'view', 17, None),
 ('table', 'video_metadata', 'video_metadata', 18, 'CREATE TABLE video_metadata (\n    video_id int primary key,\n    title varchar(255),\n    duration text(20),\n    format varchar(255),\n    file_size nemeric(20, 2),\n    video_url varchar(255)\n)'),
 ('index', 'sqlite_autoindex_video_metadata_1', 'video_metadata', 19, None),
 ('table', 'image_metadata', 'image_metadata', 20, 'CREATE TABLE image_metadata (\n    image_id int primary key,\n    title varchar(255),\n    format varchar(255),\n    file_size numeric(20, 2),\n    image_url varchar(255)\n)'),
 ('index', 'sqlite_autoindex_image_metadata_1', 'image_metadata', 21, None),
 ('table', 'post_video', 'post_video', 22, 'CREATE TABLE post_video (\n    post_id int,\n    video_id int,\n    primary key(post_id, video_id),\n    foreign key (post_id) references post(post_id),\n    foreign key (video_id) references video_metadata(video_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_post_video_1', 'post_video', 23, None),
 ('table', 'post_image', 'post_image', 24, 'CREATE TABLE post_image (\n    post_id int,\n    image_id int,\n    primary key(post_id, image_id),\n    foreign key (post_id) references post(post_id),\n    foreign key (image_id) references image_metadata(image_id) on delete cascade\n)'),
 ('index', 'sqlite_autoindex_post_image_1', 'post_image', 25, None)]

### billing_plan

In [3]:
%%sql 
create table billing_plan (
    billing_plan_id int primary key,
    payment int
)

 * sqlite:///sns.db
Done.

[]

In [4]:
%%sql insert into billing_plan(billing_plan_id, payment) 
values 
    (0, 9900),
    (1, 19900),
    (2, 29900),
    (3, 99000)

 * sqlite:///sns.db
4 rows affected.

[]

In [5]:
%sql select * from billing_plan

 * sqlite:///sns.db
Done.

[(0, 9900), (1, 19900), (2, 29900), (3, 99000)]

### user

In [6]:
%%sql
create table user (
    user_id int primary key,
    name varchar(30) not null,
    birth_date text(10) not null,
    account_number int,
    bank varchar(30),
    billing_plan_id int,
    foreign key (billing_plan_id) references billing_plan(billing_plan_id)
)

 * sqlite:///sns.db
Done.

[]

In [7]:
%%sql insert into user(user_id, name, birth_date, account_number, bank, billing_plan_id) 
values 
    (0, 'John', '2000-01-01', '0000-0000', 'small bank', null),
    (1, 'Sarah', '1999-01-01', '0000-0001', 'medium bank', 1),
    (2, 'Sena', '1998-01-01', '0000-0002', 'big bank', 2),
    (3, 'Garen', '1997-01-01', '0000-0003', 'small bank', 1),
    (4, 'Jin', '2000-02-01', '0000-0004', 'medium bank', 2),
    (5, 'Elon', '2002-12-01', '0000-0005', 'big bank', 3)

 * sqlite:///sns.db
6 rows affected.

[]

In [8]:
%sql select * from user

 * sqlite:///sns.db
Done.

[(0, 'John', '2000-01-01', '0000-0000', 'small bank', None),
 (1, 'Sarah', '1999-01-01', '0000-0001', 'medium bank', 1),
 (2, 'Sena', '1998-01-01', '0000-0002', 'big bank', 2),
 (3, 'Garen', '1997-01-01', '0000-0003', 'small bank', 1),
 (4, 'Jin', '2000-02-01', '0000-0004', 'medium bank', 2),
 (5, 'Elon', '2002-12-01', '0000-0005', 'big bank', 3)]

### follow

In [50]:
%%sql create table follow(
    follower_id int,
    following_id int,
    primary key (follower_id, following_id),
    foreign key (follower_id) references user(user_id) on delete cascade,
    foreign key (following_id) references user(user_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [51]:
%%sql insert into follow (follower_id, following_id)
values
    (0, 1),
    (0, 2),
    (0, 3),
    (1, 2),
    (1, 0),
    (2, 5),
    (2, 1),
    (3, 4),
    (3, 2),
    (4, 5),
    (4, 0),
    (5, 0),
    (5, 2),
    (5, 3)

 * sqlite:///sns.db
14 rows affected.

[]

In [52]:
%sql select * from follow

 * sqlite:///sns.db
Done.

[(0, 1),
 (0, 2),
 (0, 3),
 (1, 2),
 (1, 0),
 (2, 5),
 (2, 1),
 (3, 4),
 (3, 2),
 (4, 5),
 (4, 0),
 (5, 0),
 (5, 2),
 (5, 3)]

### post

In [12]:
%%sql create table post (
    post_id int primary key,
    text text,
    user_id int,
    foreign key (user_id) references user(user_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [13]:
%%sql insert into post (post_id, text, user_id)
values
    (0, "I think today's weather is good.", 0),
    (1, "I saw TV show bigbang's theory, today.", 1),
    (2, 'hello sns, I am Sena.', 2),
    (3, 'I like play', 3),
    (4, 'I took midterm exam.', 4),
    (5, "Let's game together.", 5)

 * sqlite:///sns.db
6 rows affected.

[]

In [14]:
%sql select * from post

 * sqlite:///sns.db
Done.

[(0, "I think today's weather is good.", 0),
 (1, "I saw TV show bigbang's theory, today.", 1),
 (2, 'hello sns, I am Sena.', 2),
 (3, 'I like play', 3),
 (4, 'I took midterm exam.', 4),
 (5, "Let's game together.", 5)]

### comment

In [15]:
%%sql create table comment (
    comment_id int primary key,
    comment text,
    user_id int,
    post_id int,
    foreign key (user_id) references user(user_id) on delete cascade,
    foreign key (post_id) references post(post_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [16]:
%%sql insert into comment (comment_id, comment, user_id, post_id)
values
    (0, "I like that TV show too.", 0, 1),
    (1, "hello Sena", 1, 2),
    (2, "I like playing soccer, what about you?", 2, 3),
    (3, "Did you took well that exam?", 3, 4),
    (4, "what game?", 4, 5),
    (5, "I agree, today' weather is good!", 5, 0)

 * sqlite:///sns.db
6 rows affected.

[]

In [17]:
%sql select * from comment

 * sqlite:///sns.db
Done.

[(0, 'I like that TV show too.', 0, 1),
 (1, 'hello Sena', 1, 2),
 (2, 'I like playing soccer, what about you?', 2, 3),
 (3, 'Did you took well that exam?', 3, 4),
 (4, 'what game?', 4, 5),
 (5, "I agree, today' weather is good!", 5, 0)]

### like_comment

In [18]:
%%sql create table like_comment (
    user_id int,
    comment_id int,
    primary key (user_id, comment_id)
    foreign key (user_id) references user(user_id) on delete cascade,
    foreign key (comment_id) references comment(comment_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [19]:
%%sql insert into like_comment (user_id, comment_id)
values
    (0, 5),
    (0, 2),
    (1, 0),
    (2, 1),
    (3, 2),
    (3, 5),
    (4, 3),
    (4, 5),
    (5, 4)

 * sqlite:///sns.db
9 rows affected.

[]

In [20]:
%sql select * from like_comment

 * sqlite:///sns.db
Done.

[(0, 5), (0, 2), (1, 0), (2, 1), (3, 2), (3, 5), (4, 3), (4, 5), (5, 4)]

### like

In [21]:
%%sql create table like (
    user_id int,
    post_id int,
    primary key (user_id, post_id)
    foreign key (user_id) references user(user_id) on delete cascade,
    foreign key (post_id) references post(post_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [22]:
%%sql insert into like (user_id, post_id)
values
    (0, 1),
    (0, 3),
    (0, 4),
    (1, 0),
    (1, 2),
    (1, 4),
    (2, 0),
    (3, 5),
    (4, 0),
    (5, 0),
    (5, 1)

 * sqlite:///sns.db
11 rows affected.

[]

In [23]:
%sql select * from like

 * sqlite:///sns.db
Done.

[(0, 1),
 (0, 3),
 (0, 4),
 (1, 0),
 (1, 2),
 (1, 4),
 (2, 0),
 (3, 5),
 (4, 0),
 (5, 0),
 (5, 1)]

### view

In [24]:
%%sql create table view (
    user_id int,
    post_id int,
    primary key (user_id, post_id)
    foreign key (user_id) references user(user_id) on delete cascade,
    foreign key (post_id) references post(post_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [25]:
%%sql insert into view (user_id, post_id)
values
    (0, 1),
    (0, 3),
    (0, 4),
    (1, 0),
    (1, 2),
    (1, 4),
    (2, 0),
    (3, 5),
    (4, 0),
    (5, 0),
    (5, 1)

 * sqlite:///sns.db
11 rows affected.

[]

In [26]:
%sql select * from view

 * sqlite:///sns.db
Done.

[(0, 1),
 (0, 3),
 (0, 4),
 (1, 0),
 (1, 2),
 (1, 4),
 (2, 0),
 (3, 5),
 (4, 0),
 (5, 0),
 (5, 1)]

### video_metadata

In [27]:
%%sql create table video_metadata (
    video_id int primary key,
    title varchar(255),
    duration text(20),
    format varchar(255),
    file_size nemeric(20, 2),
    video_url varchar(255)
)

 * sqlite:///sns.db
Done.

[]

In [28]:
%%sql insert into video_metadata(video_id, title, duration, format, file_size, video_url)
values
    (0, "bigbang's theory season 1, episode 1", "00:30:00", "mp4", 1000000000, "http://localhost:3000/bigbang's_theory_01_01"),
    (1, "bigbang's theory season 9, episode 22", "00:25:00", "mp4", 1000000000, "http://localhost:300/bigbang's_theory_09_22")

 * sqlite:///sns.db
2 rows affected.

[]

In [29]:
%sql select * from video_metadata

 * sqlite:///sns.db
Done.

[(0, "bigbang's theory season 1, episode 1", '00:30:00', 'mp4', 1000000000, "http://localhost:3000/bigbang's_theory_01_01"),
 (1, "bigbang's theory season 9, episode 22", '00:25:00', 'mp4', 1000000000, "http://localhost:300/bigbang's_theory_09_22")]

### image_metadata

In [30]:
%%sql create table image_metadata (
    image_id int primary key,
    title varchar(255),
    format varchar(255),
    file_size numeric(20, 2),
    image_url varchar(255)
)

 * sqlite:///sns.db
Done.

[]

In [31]:
%%sql insert into image_metadata (image_id, title, format, file_size, image_url)
values
    (0, "selfie_20231105_01", "png", 3000000, "http://localhost:3000/image/231105_01"),
    (1, "dog_20231005_09", "png", 4000000, "http://localhost:300/image/231005_09")

 * sqlite:///sns.db
2 rows affected.

[]

In [32]:
%sql select * from image_metadata

 * sqlite:///sns.db
Done.

[(0, 'selfie_20231105_01', 'png', 3000000, 'http://localhost:3000/image/231105_01'),
 (1, 'dog_20231005_09', 'png', 4000000, 'http://localhost:300/image/231005_09')]

### post_video

In [33]:
%%sql create table post_video (
    post_id int,
    video_id int,
    primary key(post_id, video_id),
    foreign key (post_id) references post(post_id),
    foreign key (video_id) references video_metadata(video_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [34]:
%%sql insert into post_video (post_id, video_id)
values
    (1, 0),
    (1, 1),
    (4, 1)

 * sqlite:///sns.db
3 rows affected.

[]

In [35]:
%sql select * from post_video

 * sqlite:///sns.db
Done.

[(1, 0), (1, 1), (4, 1)]

### post_image

In [36]:
%%sql create table post_image (
    post_id int,
    image_id int,
    primary key(post_id, image_id),
    foreign key (post_id) references post(post_id),
    foreign key (image_id) references image_metadata(image_id) on delete cascade
)

 * sqlite:///sns.db
Done.

[]

In [37]:
%%sql insert into post_image (post_id, image_id)
values
    (0, 0),
    (3, 1)

 * sqlite:///sns.db
2 rows affected.

[]

In [38]:
%sql select * from post_image

 * sqlite:///sns.db
Done.

[(0, 0), (3, 1)]

# query

In [53]:
%%sql
select
U.name as name,
(select count(*) 
from follow as F
where F.follower_id = U.user_id ) as follwers,
(select count(*) 
from follow as F
where F.following_id = U.user_id ) as follwing
from user as U;

 * sqlite:///sns.db
Done.

[('John', 3, 3),
 ('Sarah', 2, 2),
 ('Sena', 2, 4),
 ('Garen', 2, 2),
 ('Jin', 2, 1),
 ('Elon', 3, 2)]

In [54]:
%%sql
select
U.name as name,
(select count(*) from follow as F where F.follower_id = U.user_id ) as follwers,
(select count(*) from follow as F where F.following_id = U.user_id ) as follwing
from user as U
where U. user_id = 1;

 * sqlite:///sns.db
Done.

[('Sarah', 2, 2)]

In [41]:
%%sql
select B.billing_plan_id, B.payment, count(*) as number 
from user as U,billing_plan as B 
where U.billing_plan_id = B.billing_plan_id
group by U.billing_plan_id

 * sqlite:///sns.db
Done.

[(1, 19900, 2), (2, 29900, 2), (3, 99000, 1)]

In [42]:
%%sql
select C.user_id, C.comment,
(select count(*) from like_comment where C.comment_id = like_comment.comment_id group by comment_id) as like_num
from post as P, comment as C 
where P.post_id = 0 and P.post_id = C.post_id
order by like_num

 * sqlite:///sns.db
Done.

[(5, "I agree, today' weather is good!", 3)]

In [43]:
%sql select user_id, (select video_url from video_metadata as V where V.video_id = video_id)as video_url, text  from post_video natural join post  where user_id = 4

 * sqlite:///sns.db
Done.

[(4, "http://localhost:3000/bigbang's_theory_01_01", 'I took midterm exam.')]

In [44]:
%%sql select post_id ,
(select count(*) from view where P.post_id = view.post_id group by post_id) as view_num, 
(select count(*) from like where P.post_id = like.post_id group by post_id) as like_num,
(select count(*) from comment where P.post_id = comment.post_id group by post_id) as comment_num
from  post as P 
where user_id = 0

 * sqlite:///sns.db
Done.

[(0, 4, 4, 1)]

In [45]:
%%sql select user_id ,
(select count(*) from view where P.user_id = view.user_id group by user_id) as view_num, 
(select count(*) from like where P.user_id = like.user_id group by user_id) as like_num,
(select count(*) from comment where P.user_id = comment.user_id group by post_id) as comment_num
from  post as P 
where user_id = 0

 * sqlite:///sns.db
Done.

[(0, 3, 3, 1)]

In [55]:
%%sql 
select post_id,text,title,image_url
from post natural join image_metadata
where post_id in
(select post_id 
from post 
where user_id in (select follower_id from follow where following_id = 0) and 
post_id not in (select post_id from view where user_id = 0))

 * sqlite:///sns.db
Done.

[(5, "Let's game together.", 'selfie_20231105_01', 'http://localhost:3000/image/231105_01'),
 (5, "Let's game together.", 'dog_20231005_09', 'http://localhost:300/image/231005_09')]